public class Main {
    public static void main(String[] args) {
        /* Задание 1 "Приветствие" */
        Task1.Greeting();
        System.out.print("\n-------------------\n");
        /* Задание 2 "Конвертер температур" */
        Task2.ConvertTemperature();
        System.out.print("\n-------------------\n");
        /* Задание 3 "Арифметика двух чисел" */
        Task3.SimpleArithmetic();
        System.out.print("\n-------------------\n");
        /* Задание 4 "Сумма цифр трёхзначного числа" */
        Task4.SumNumsBase();
        Task4.SumNumsCicle();
        System.out.print("\n-------------------\n");
        /* Задание 5 "Длина окружности и площадь круга" */
        Task5.CircleSLen();
        System.out.print("\n-------------------\n");
        /* Задание 6 "Расстояние между точками" */
        Task6.Dist();
        System.out.print("\n-------------------\n");
        /* Задание 7 "Перевод минут в часы и минуты" */
        Task7.MinsTtHours();
        System.out.print("\n-------------------\n");
        /* Задание 8 "Перевёртыш трёхзначного числа" */
        Task8.ReverseNum();
        Task8.ReverseNumWithIf();
        System.out.print("\n-------------------\n");
    }
}